MikroElektronika/core_packages/PIC/XC8/def/PIC18F25Q10/mcu.h
// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0xEB1);
#ifndef _LIB_BUILD
asm("CK1PPS equ 0EB1h");
#endif
// aliases
extern volatile unsigned char           TXPPS               __at(0xEB1);
#ifndef _LIB_BUILD
asm("TXPPS equ 0EB1h");
#endif
extern volatile unsigned char           CKPPS               __at(0xEB1);
#ifndef _LIB_BUILD
asm("CKPPS equ 0EB1h");
#endif
extern volatile unsigned char           TXCK1PPS            __at(0xEB1);
#ifndef _LIB_BUILD
asm("TXCK1PPS equ 0EB1h");
#endif
extern volatile unsigned char           TX1PPS              __at(0xEB1);
#ifndef _LIB_BUILD
asm("TX1PPS equ 0EB1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS0                 :1;
        unsigned TXPPS1                 :1;
        unsigned TXPPS2                 :1;
        unsigned TXPPS3                 :1;
        unsigned TXPPS4                 :1;
    };
    struct {
        unsigned TXPPS                  :5;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0xEB1);
// bitfield macros
#define _CK1PPS_PIN_POSN                                    0x0
#define _CK1PPS_PIN_POSITION                                0x0
#define _CK1PPS_PIN_SIZE                                    0x3
#define _CK1PPS_PIN_LENGTH                                  0x3
#define _CK1PPS_PIN_MASK                                    0x7
#define _CK1PPS_PORT_POSN                                   0x3
#define _CK1PPS_PORT_POSITION                               0x3
#define _CK1PPS_PORT_SIZE                                   0x2
#define _CK1PPS_PORT_LENGTH                                 0x2
#define _CK1PPS_PORT_MASK                                   0x18
#define _CK1PPS_TXPPS0_POSN                                 0x0
#define _CK1PPS_TXPPS0_POSITION                             0x0
#define _CK1PPS_TXPPS0_SIZE                                 0x1
#define _CK1PPS_TXPPS0_LENGTH                               0x1
#define _CK1PPS_TXPPS0_MASK                                 0x1
#define _CK1PPS_TXPPS1_POSN                                 0x1
#define _CK1PPS_TXPPS1_POSITION                             0x1
#define _CK1PPS_TXPPS1_SIZE                                 0x1
#define _CK1PPS_TXPPS1_LENGTH                               0x1
#define _CK1PPS_TXPPS1_MASK                                 0x2
#define _CK1PPS_TXPPS2_POSN                                 0x2
#define _CK1PPS_TXPPS2_POSITION                             0x2
#define _CK1PPS_TXPPS2_SIZE                                 0x1
#define _CK1PPS_TXPPS2_LENGTH                               0x1
#define _CK1PPS_TXPPS2_MASK                                 0x4
#define _CK1PPS_TXPPS3_POSN                                 0x3
#define _CK1PPS_TXPPS3_POSITION                             0x3
#define _CK1PPS_TXPPS3_SIZE                                 0x1
#define _CK1PPS_TXPPS3_LENGTH                               0x1
#define _CK1PPS_TXPPS3_MASK                                 0x8
#define _CK1PPS_TXPPS4_POSN                                 0x4
#define _CK1PPS_TXPPS4_POSITION                             0x4
#define _CK1PPS_TXPPS4_SIZE                                 0x1
#define _CK1PPS_TXPPS4_LENGTH                               0x1
#define _CK1PPS_TXPPS4_MASK                                 0x10
#define _CK1PPS_TXPPS_POSN                                  0x0
#define _CK1PPS_TXPPS_POSITION                              0x0
#define _CK1PPS_TXPPS_SIZE                                  0x5
#define _CK1PPS_TXPPS_LENGTH                                0x5
#define _CK1PPS_TXPPS_MASK                                  0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS0                 :1;
        unsigned TXPPS1                 :1;
        unsigned TXPPS2                 :1;
        unsigned TXPPS3                 :1;
        unsigned TXPPS4                 :1;
    };
    struct {
        unsigned TXPPS                  :5;
    };
} TXPPSbits_t;
extern volatile TXPPSbits_t TXPPSbits __at(0xEB1);
// bitfield macros
#define _TXPPS_PIN_POSN                                     0x0
#define _TXPPS_PIN_POSITION                                 0x0
#define _TXPPS_PIN_SIZE                                     0x3
#define _TXPPS_PIN_LENGTH                                   0x3
#define _TXPPS_PIN_MASK                                     0x7
#define _TXPPS_PORT_POSN                                    0x3
#define _TXPPS_PORT_POSITION                                0x3
#define _TXPPS_PORT_SIZE                                    0x2
#define _TXPPS_PORT_LENGTH                                  0x2
#define _TXPPS_PORT_MASK                                    0x18
#define _TXPPS_TXPPS0_POSN                                  0x0
#define _TXPPS_TXPPS0_POSITION                              0x0
#define _TXPPS_TXPPS0_SIZE                                  0x1
#define _TXPPS_TXPPS0_LENGTH                                0x1
#define _TXPPS_TXPPS0_MASK                                  0x1
#define _TXPPS_TXPPS1_POSN                                  0x1
#define _TXPPS_TXPPS1_POSITION                              0x1
#define _TXPPS_TXPPS1_SIZE                                  0x1
#define _TXPPS_TXPPS1_LENGTH                                0x1
#define _TXPPS_TXPPS1_MASK                                  0x2
#define _TXPPS_TXPPS2_POSN                                  0x2
#define _TXPPS_TXPPS2_POSITION                              0x2
#define _TXPPS_TXPPS2_SIZE                                  0x1
#define _TXPPS_TXPPS2_LENGTH                                0x1
#define _TXPPS_TXPPS2_MASK                                  0x4
#define _TXPPS_TXPPS3_POSN                                  0x3
#define _TXPPS_TXPPS3_POSITION                              0x3
#define _TXPPS_TXPPS3_SIZE                                  0x1
#define _TXPPS_TXPPS3_LENGTH                                0x1
#define _TXPPS_TXPPS3_MASK                                  0x8
#define _TXPPS_TXPPS4_POSN                                  0x4
#define _TXPPS_TXPPS4_POSITION                              0x4
#define _TXPPS_TXPPS4_SIZE                                  0x1
#define _TXPPS_TXPPS4_LENGTH                                0x1
#define _TXPPS_TXPPS4_MASK                                  0x10
#define _TXPPS_TXPPS_POSN                                   0x0
#define _TXPPS_TXPPS_POSITION                               0x0
#define _TXPPS_TXPPS_SIZE                                   0x5
#define _TXPPS_TXPPS_LENGTH                                 0x5
#define _TXPPS_TXPPS_MASK                                   0x1F
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS0                 :1;
        unsigned TXPPS1                 :1;
        unsigned TXPPS2                 :1;
        unsigned TXPPS3                 :1;
        unsigned TXPPS4                 :1;
    };
    struct {
        unsigned TXPPS                  :5;
    };
} CKPPSbits_t;
