MikroElektronika/core_packages/PIC/XC8/def/PIC18F25Q10/mcu.h
#define                                 T6OUTPS1_bit        _BIT_ACCESS(T6CON,1)
// T6CON<T6OUTPS2>
extern volatile __bit                   T6OUTPS2            __at(0x7D82);	// @ (0xFB0 * 8 + 2)
#define                                 T6OUTPS2_bit        _BIT_ACCESS(T6CON,2)
// T6CON<T6OUTPS3>
extern volatile __bit                   T6OUTPS3            __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 T6OUTPS3_bit        _BIT_ACCESS(T6CON,3)
// T6HLT<T6PSYNC>
extern volatile __bit                   T6PSYNC             __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 T6PSYNC_bit         _BIT_ACCESS(T6HLT,7)
// T6RST<T6RSEL0>
extern volatile __bit                   T6RSEL0             __at(0x7D98);	// @ (0xFB3 * 8 + 0)
#define                                 T6RSEL0_bit         _BIT_ACCESS(T6RST,0)
// T6RST<T6RSEL1>
extern volatile __bit                   T6RSEL1             __at(0x7D99);	// @ (0xFB3 * 8 + 1)
#define                                 T6RSEL1_bit         _BIT_ACCESS(T6RST,1)
// T6RST<T6RSEL2>
extern volatile __bit                   T6RSEL2             __at(0x7D9A);	// @ (0xFB3 * 8 + 2)
#define                                 T6RSEL2_bit         _BIT_ACCESS(T6RST,2)
// T6RST<T6RSEL3>
extern volatile __bit                   T6RSEL3             __at(0x7D9B);	// @ (0xFB3 * 8 + 3)
#define                                 T6RSEL3_bit         _BIT_ACCESS(T6RST,3)
// TMR0H<TMR0H0>
extern volatile __bit                   TMR0H0              __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 TMR0H0_bit          _BIT_ACCESS(TMR0H,0)
// TMR0H<TMR0H1>
extern volatile __bit                   TMR0H1              __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 TMR0H1_bit          _BIT_ACCESS(TMR0H,1)
// TMR0H<TMR0H2>
extern volatile __bit                   TMR0H2              __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 TMR0H2_bit          _BIT_ACCESS(TMR0H,2)
// TMR0H<TMR0H3>
extern volatile __bit                   TMR0H3              __at(0x7E9B);	// @ (0xFD3 * 8 + 3)
#define                                 TMR0H3_bit          _BIT_ACCESS(TMR0H,3)
// TMR0H<TMR0H4>
extern volatile __bit                   TMR0H4              __at(0x7E9C);	// @ (0xFD3 * 8 + 4)
#define                                 TMR0H4_bit          _BIT_ACCESS(TMR0H,4)
// TMR0H<TMR0H5>
extern volatile __bit                   TMR0H5              __at(0x7E9D);	// @ (0xFD3 * 8 + 5)
#define                                 TMR0H5_bit          _BIT_ACCESS(TMR0H,5)
// TMR0H<TMR0H6>
extern volatile __bit                   TMR0H6              __at(0x7E9E);	// @ (0xFD3 * 8 + 6)
#define                                 TMR0H6_bit          _BIT_ACCESS(TMR0H,6)
// TMR0H<TMR0H7>
extern volatile __bit                   TMR0H7              __at(0x7E9F);	// @ (0xFD3 * 8 + 7)
#define                                 TMR0H7_bit          _BIT_ACCESS(TMR0H,7)
// PIE0<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x75ED);	// @ (0xEBD * 8 + 5)
#define                                 TMR0IE_bit          _BIT_ACCESS(PIE0,5)
// PIR0<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x762D);	// @ (0xEC5 * 8 + 5)
#define                                 TMR0IF_bit          _BIT_ACCESS(PIR0,5)
// IPR0<TMR0IP>
extern volatile __bit                   TMR0IP              __at(0x75AD);	// @ (0xEB5 * 8 + 5)
#define                                 TMR0IP_bit          _BIT_ACCESS(IPR0,5)
// TMR0L<TMR0L0>
extern volatile __bit                   TMR0L0              __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 TMR0L0_bit          _BIT_ACCESS(TMR0L,0)
// TMR0L<TMR0L1>
extern volatile __bit                   TMR0L1              __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 TMR0L1_bit          _BIT_ACCESS(TMR0L,1)
// TMR0L<TMR0L2>
extern volatile __bit                   TMR0L2              __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 TMR0L2_bit          _BIT_ACCESS(TMR0L,2)
// TMR0L<TMR0L3>
extern volatile __bit                   TMR0L3              __at(0x7E93);	// @ (0xFD2 * 8 + 3)
#define                                 TMR0L3_bit          _BIT_ACCESS(TMR0L,3)
// TMR0L<TMR0L4>
extern volatile __bit                   TMR0L4              __at(0x7E94);	// @ (0xFD2 * 8 + 4)
#define                                 TMR0L4_bit          _BIT_ACCESS(TMR0L,4)
// TMR0L<TMR0L5>
extern volatile __bit                   TMR0L5              __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 TMR0L5_bit          _BIT_ACCESS(TMR0L,5)
// TMR0L<TMR0L6>
extern volatile __bit                   TMR0L6              __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 TMR0L6_bit          _BIT_ACCESS(TMR0L,6)
// TMR0L<TMR0L7>
extern volatile __bit                   TMR0L7              __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 TMR0L7_bit          _BIT_ACCESS(TMR0L,7)
// PMD1<TMR0MD>
extern volatile __bit                   TMR0MD              __at(0x76E8);	// @ (0xEDD * 8 + 0)
#define                                 TMR0MD_bit          _BIT_ACCESS(PMD1,0)
// TMR1L<TMR10>
extern volatile __bit                   TMR10               __at(0x7E60);	// @ (0xFCC * 8 + 0)
#define                                 TMR10_bit           _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR11>
extern volatile __bit                   TMR11               __at(0x7E61);	// @ (0xFCC * 8 + 1)
#define                                 TMR11_bit           _BIT_ACCESS(TMR1L,1)
// TMR1H<TMR110>
extern volatile __bit                   TMR110              __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 TMR110_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR111>
extern volatile __bit                   TMR111              __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 TMR111_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR112>
extern volatile __bit                   TMR112              __at(0x7E6C);	// @ (0xFCD * 8 + 4)
#define                                 TMR112_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR113>
extern volatile __bit                   TMR113              __at(0x7E6D);	// @ (0xFCD * 8 + 5)
#define                                 TMR113_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR114>
extern volatile __bit                   TMR114              __at(0x7E6E);	// @ (0xFCD * 8 + 6)
#define                                 TMR114_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR115>
extern volatile __bit                   TMR115              __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 TMR115_bit          _BIT_ACCESS(TMR1H,7)
// TMR1L<TMR12>
extern volatile __bit                   TMR12               __at(0x7E62);	// @ (0xFCC * 8 + 2)
#define                                 TMR12_bit           _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR13>
extern volatile __bit                   TMR13               __at(0x7E63);	// @ (0xFCC * 8 + 3)
#define                                 TMR13_bit           _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR14>
extern volatile __bit                   TMR14               __at(0x7E64);	// @ (0xFCC * 8 + 4)
#define                                 TMR14_bit           _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR15>
extern volatile __bit                   TMR15               __at(0x7E65);	// @ (0xFCC * 8 + 5)
#define                                 TMR15_bit           _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR16>
extern volatile __bit                   TMR16               __at(0x7E66);	// @ (0xFCC * 8 + 6)
#define                                 TMR16_bit           _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR17>
extern volatile __bit                   TMR17               __at(0x7E67);	// @ (0xFCC * 8 + 7)
#define                                 TMR17_bit           _BIT_ACCESS(TMR1L,7)
// TMR1H<TMR18>
extern volatile __bit                   TMR18               __at(0x7E68);	// @ (0xFCD * 8 + 0)
#define                                 TMR18_bit           _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR19>
extern volatile __bit                   TMR19               __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 TMR19_bit           _BIT_ACCESS(TMR1H,1)
// PIE5<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x7610);	// @ (0xEC2 * 8 + 0)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE5,0)
// PIR5<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x7650);	// @ (0xECA * 8 + 0)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR5,0)
// IPR5<TMR1GIP>
extern volatile __bit                   TMR1GIP             __at(0x75D0);	// @ (0xEBA * 8 + 0)
#define                                 TMR1GIP_bit         _BIT_ACCESS(IPR5,0)
// TMR1H<TMR1H0>
extern volatile __bit                   TMR1H0              __at(0x7E68);	// @ (0xFCD * 8 + 0)
#define                                 TMR1H0_bit          _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR1H1>
extern volatile __bit                   TMR1H1              __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 TMR1H1_bit          _BIT_ACCESS(TMR1H,1)
// TMR1H<TMR1H2>
extern volatile __bit                   TMR1H2              __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 TMR1H2_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR1H3>
extern volatile __bit                   TMR1H3              __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 TMR1H3_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR1H4>
extern volatile __bit                   TMR1H4              __at(0x7E6C);	// @ (0xFCD * 8 + 4)
#define                                 TMR1H4_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR1H5>
extern volatile __bit                   TMR1H5              __at(0x7E6D);	// @ (0xFCD * 8 + 5)
#define                                 TMR1H5_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR1H6>
extern volatile __bit                   TMR1H6              __at(0x7E6E);	// @ (0xFCD * 8 + 6)
#define                                 TMR1H6_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR1H7>
extern volatile __bit                   TMR1H7              __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 TMR1H7_bit          _BIT_ACCESS(TMR1H,7)
// PIE4<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x7608);	// @ (0xEC1 * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x7648);	// @ (0xEC9 * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<TMR1IP>
extern volatile __bit                   TMR1IP              __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 TMR1IP_bit          _BIT_ACCESS(IPR4,0)
// TMR1L<TMR1L0>
extern volatile __bit                   TMR1L0              __at(0x7E60);	// @ (0xFCC * 8 + 0)
#define                                 TMR1L0_bit          _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR1L1>
extern volatile __bit                   TMR1L1              __at(0x7E61);	// @ (0xFCC * 8 + 1)
#define                                 TMR1L1_bit          _BIT_ACCESS(TMR1L,1)
// TMR1L<TMR1L2>
extern volatile __bit                   TMR1L2              __at(0x7E62);	// @ (0xFCC * 8 + 2)
#define                                 TMR1L2_bit          _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR1L3>
extern volatile __bit                   TMR1L3              __at(0x7E63);	// @ (0xFCC * 8 + 3)
#define                                 TMR1L3_bit          _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR1L4>
extern volatile __bit                   TMR1L4              __at(0x7E64);	// @ (0xFCC * 8 + 4)
#define                                 TMR1L4_bit          _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR1L5>
extern volatile __bit                   TMR1L5              __at(0x7E65);	// @ (0xFCC * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x7E66);	// @ (0xFCC * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x7E67);	// @ (0xFCC * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x76E9);	// @ (0xEDD * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x7E70);	// @ (0xFCE * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE4<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x7609);	// @ (0xEC1 * 8 + 1)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x7649);	// @ (0xEC9 * 8 + 1)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<TMR2IP>
extern volatile __bit                   TMR2IP              __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR4,1)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x76EA);	// @ (0xEDD * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x7DE7);	// @ (0xFBC * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// TMR3L<TMR30>
extern volatile __bit                   TMR30               __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 TMR30_bit           _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR31>
extern volatile __bit                   TMR31               __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 TMR31_bit           _BIT_ACCESS(TMR3L,1)
// TMR3H<TMR310>
extern volatile __bit                   TMR310              __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 TMR310_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR311>
extern volatile __bit                   TMR311              __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 TMR311_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR312>
extern volatile __bit                   TMR312              __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 TMR312_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR313>
extern volatile __bit                   TMR313              __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 TMR313_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR314>
extern volatile __bit                   TMR314              __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 TMR314_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR315>
extern volatile __bit                   TMR315              __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 TMR315_bit          _BIT_ACCESS(TMR3H,7)
// TMR3L<TMR32>
extern volatile __bit                   TMR32               __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 TMR32_bit           _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR33>
extern volatile __bit                   TMR33               __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 TMR33_bit           _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR34>
extern volatile __bit                   TMR34               __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 TMR34_bit           _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR35>
extern volatile __bit                   TMR35               __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 TMR35_bit           _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR36>
extern volatile __bit                   TMR36               __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 TMR36_bit           _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR37>
extern volatile __bit                   TMR37               __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 TMR37_bit           _BIT_ACCESS(TMR3L,7)
// TMR3H<TMR38>
extern volatile __bit                   TMR38               __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 TMR38_bit           _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR39>
extern volatile __bit                   TMR39               __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 TMR39_bit           _BIT_ACCESS(TMR3H,1)
// PIE5<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x7611);	// @ (0xEC2 * 8 + 1)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE5,1)
// PIR5<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x7651);	// @ (0xECA * 8 + 1)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR5,1)
// IPR5<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR5,1)
// TMR3H<TMR3H0>
extern volatile __bit                   TMR3H0              __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 TMR3H0_bit          _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR3H1>
extern volatile __bit                   TMR3H1              __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 TMR3H1_bit          _BIT_ACCESS(TMR3H,1)
// TMR3H<TMR3H2>
extern volatile __bit                   TMR3H2              __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 TMR3H2_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR3H3>
extern volatile __bit                   TMR3H3              __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
extern volatile __bit                   TMR3H5              __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE4<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x760A);	// @ (0xEC1 * 8 + 2)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x764A);	// @ (0xEC9 * 8 + 2)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR4,2)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x76EB);	// @ (0xEDD * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE4<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x760B);	// @ (0xEC1 * 8 + 3)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x764B);	// @ (0xEC9 * 8 + 3)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR4,3)
// IPR4<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR4,3)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x76EC);	// @ (0xEDD * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// TMR5L<TMR50>
extern volatile __bit                   TMR50               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 TMR50_bit           _BIT_ACCESS(TMR5L,0)
// TMR5L<TMR51>
extern volatile __bit                   TMR51               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 TMR51_bit           _BIT_ACCESS(TMR5L,1)
// TMR5H<TMR510>
extern volatile __bit                   TMR510              __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 TMR510_bit          _BIT_ACCESS(TMR5H,2)
// TMR5H<TMR511>
extern volatile __bit                   TMR511              __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 TMR511_bit          _BIT_ACCESS(TMR5H,3)
// TMR5H<TMR512>
extern volatile __bit                   TMR512              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 TMR512_bit          _BIT_ACCESS(TMR5H,4)
// TMR5H<TMR513>
extern volatile __bit                   TMR513              __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 TMR513_bit          _BIT_ACCESS(TMR5H,5)
// TMR5H<TMR514>
extern volatile __bit                   TMR514              __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 TMR514_bit          _BIT_ACCESS(TMR5H,6)
// TMR5H<TMR515>
